content/post/nfs-over-rdma/logs/tcp_fio_bs64k_iodepth12.log
task1: (g=0): rw=randread, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=12
fio-3.33
Starting 1 process

task1: (groupid=0, jobs=1): err= 0: pid=10389: Sat Jul 20 21:42:55 2024
  read: IOPS=30.4k, BW=1903MiB/s (1995MB/s)(55.8GiB/30001msec)
    slat (nsec): min=3010, max=103828, avg=4506.90, stdev=630.87
    clat (usec): min=133, max=3678, avg=389.27, stdev=66.96
     lat (usec): min=147, max=3682, avg=393.77, stdev=66.97
    clat percentiles (usec):
     |  1.00th=[  269],  5.00th=[  302], 10.00th=[  318], 20.00th=[  338],
     | 30.00th=[  355], 40.00th=[  371], 50.00th=[  383], 60.00th=[  396],
     | 70.00th=[  412], 80.00th=[  433], 90.00th=[  465], 95.00th=[  502],
     | 99.00th=[  603], 99.50th=[  644], 99.90th=[  824], 99.95th=[  922],
     | 99.99th=[ 1139]
   bw (  MiB/s): min= 1825, max= 1982, per=99.97%, avg=1902.34, stdev=39.48, samples=59
   iops        : min=29214, max=31718, avg=30437.42, stdev=631.70, samples=59
  lat (usec)   : 250=0.31%, 500=94.44%, 750=5.08%, 1000=0.15%
  lat (msec)   : 2=0.03%, 4=0.01%
  cpu          : usr=2.42%, sys=17.44%, ctx=890190, majf=0, minf=201
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=913448,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=12

Run status group 0 (all jobs):
   READ: bw=1903MiB/s (1995MB/s), 1903MiB/s-1903MiB/s (1995MB/s-1995MB/s), io=55.8GiB (59.9GB), run=30001-30001msec