content/post/nfs-over-rdma/logs/tcp_fio_bs64k_iodepth24.log
task1: (g=0): rw=randread, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=24
fio-3.33
Starting 1 process

task1: (groupid=0, jobs=1): err= 0: pid=10474: Sat Jul 20 21:43:56 2024
  read: IOPS=32.6k, BW=2038MiB/s (2137MB/s)(59.7GiB/30001msec)
    slat (nsec): min=3008, max=96847, avg=4590.19, stdev=601.41
    clat (usec): min=308, max=4276, avg=731.17, stdev=119.90
     lat (usec): min=320, max=4281, avg=735.76, stdev=119.90
    clat percentiles (usec):
     |  1.00th=[  510],  5.00th=[  537], 10.00th=[  578], 20.00th=[  627],
     | 30.00th=[  668], 40.00th=[  701], 50.00th=[  734], 60.00th=[  758],
     | 70.00th=[  791], 80.00th=[  824], 90.00th=[  873], 95.00th=[  922],
     | 99.00th=[ 1045], 99.50th=[ 1123], 99.90th=[ 1352], 99.95th=[ 1450],
     | 99.99th=[ 1631]
   bw (  MiB/s): min= 1900, max= 2176, per=100.00%, avg=2038.37, stdev=58.42, samples=59
   iops        : min=30412, max=34826, avg=32613.93, stdev=934.75, samples=59
  lat (usec)   : 500=0.61%, 750=56.32%, 1000=41.42%
  lat (msec)   : 2=1.65%, 4=0.01%, 10=0.01%
  cpu          : usr=3.27%, sys=18.53%, ctx=961470, majf=0, minf=392
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=978105,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=24

Run status group 0 (all jobs):
   READ: bw=2038MiB/s (2137MB/s), 2038MiB/s-2038MiB/s (2137MB/s-2137MB/s), io=59.7GiB (64.1GB), run=30001-30001msec